blog/app/controllers/articles_controller.rb

    def create
        # render plain: params[:article].inspect
        @article = Article.new(article_params);

        if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Article1"], ["text", "blah blah blah"], ["created_at", 2017-03-03 03:38:20 UTC], ["updated_at", 2017-03-03 03:38:20 UTC]]